RT-Thread/rt-thread/bsp/apm32/libraries/APM32F0xx_Library/APM32F0xx_StdPeriphDriver/src/apm32f0xx_usart.c
    if (invPin == USART_INVERSION_TX)
    {
        usart->CTRL2_B.TXINVEN = BIT_SET;
    }

    if (invPin == (USART_INVERSION_TX_RX))
    {
        usart->CTRL2_B.TXINVEN = BIT_SET;
        usart->CTRL2_B.RXINVEN = BIT_SET;
    }
}

/*!
 * @brief       Disables the specified USART peripheral
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3/USART4/USART5/USART6/USART7/USART8.
 *
 * @param       invPin: specifies the USART pin(s) to invert
 *              This parameter can be one of the following values:
 *              @arg USART_INVERSION_RX: USART Tx pin active level inversion
 *              @arg USART_INVERSION_TX: USART Rx pin active level inversion
 *              @arg USART_INVERSION_TX_RX: USART TX Rx pin active level inversion
 *
 * @retval      None
 *
 * @note        The USART3/USART4 only for APM32F072 and APM32F091 devices.
 *              USART5, USART6, USART7 and USART8 are available only for APM32F091 devices.
 */
void USART_DisableInvPin(USART_T* usart, USART_INVERSION_T invPin)
{
    if (invPin == USART_INVERSION_RX)
    {
        usart->CTRL2_B.RXINVEN = BIT_RESET;
    }

    if (invPin == USART_INVERSION_TX)
    {
        usart->CTRL2_B.TXINVEN = BIT_RESET;
    }

    if (invPin == USART_INVERSION_TX_RX)
    {
        usart->CTRL2_B.TXINVEN = BIT_RESET;
        usart->CTRL2_B.RXINVEN = BIT_RESET;
    }
}

/*!
 * @brief       Enables the swap Tx/Rx pins
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3/USART4/USART5/USART6/USART7/USART8.
 *
 * @retval      None
 *
 * @note        The USART3/USART4 only for APM32F072 and APM32F091 devices.
 *              USART5, USART6, USART7 and USART8 are available only for APM32F091 devices.
 */
void USART_EnableSWAPPin(USART_T* usart)
{
    usart->CTRL2_B.SWAPEN = BIT_SET;
}

/*!
 * @brief       Disables the swap Tx/Rx pins
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3/USART4/USART5/USART6/USART7/USART8.
 *
 * @retval      None
 *
 * @note        The USART3/USART4 only for APM32F072 and APM32F091 devices.
 *              USART5, USART6, USART7 and USART8 are available only for APM32F091 devices.
 */
void USART_DisableSWAPPin(USART_T* usart)
{
    usart->CTRL2_B.SWAPEN = BIT_RESET;
}

/*!
 * @brief       Enables the receiver Time Out feature
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_EnableReceiverTimeOut(USART_T* usart)
{
    usart->CTRL2_B.RXTODEN = BIT_SET;
}

/*!
 * @brief       Disables the receiver Time Out feature
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_DisableReceiverTimeOut(USART_T* usart)
{
    usart->CTRL2_B.RXTODEN = BIT_RESET;
}

/*!
 * @brief       Sets the receiver Time Out value
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @param       timeOut: Specifies the Receiver Time Out value
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 *
 * @note        The value must less than 0x00FFFFFF
 */
void USART_ReceiverTimeOutValue(USART_T* usart, uint32_t timeOut)
{
    usart->RXTO = (uint32_t)0x00;

    if (timeOut <= (uint32_t)0x00FFFFFF)
    {
        usart->RXTO = ((uint32_t)timeOut & 0x00FFFFFF);
    }
}

/*!
 * @brief       Sets the system clock divider.
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @param       divider: Specifies the prescaler clock value
 *
 * @retval      None
 *
 * @note        It's not for APM32F030 devices.
 *              The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_ConfigDivider(USART_T* usart, uint8_t divider)
{
    usart->GTPSC &= (uint16_t)0xFF00;
    usart->GTPSC_B.PSC = (uint8_t)divider;
}

/*!
 * @brief       Enables the stop mode
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_EnableStopMode(USART_T* usart)
{
    usart->CTRL1_B.USWMEN = BIT_SET;
}

/*!
 * @brief       Disables the stop mode
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_DisableStopMode(USART_T* usart)
{
    usart->CTRL1_B.USWMEN = BIT_RESET;
}

/*!
 * @brief       Selects the USART WakeUp method form stop mode.
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @param       source: Specifies the selected USART wakeup method
 *                      This parameter can be one of the following values:
 *                      @arg USART_WAKEUP_SOURCE_ADDRESS:  WUP active on address match.
 *                      @arg USART_WAKEUP_SOURCE_START: WUP active on Start bit detection.
 *                      @arg USART_WAKEUP_SOURCE_RXNE:  WUP active on RXNE.
 *
 * @note        It's not for APM32F030 devices.
 *              The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_ConfigStopModeWakeUpSource(USART_T* usart, USART_WAKEUP_SOURCE_T source)
{
    usart->CTRL3_B.WSIFLGSEL = source;
}

/*!
 * @brief       Enables the auto baud rate
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_EnableAutoBaudRate(USART_T* usart)
{
    usart->CTRL2_B.ABRDEN = BIT_SET;
}

/*!
 * @brief       Disables the auto baud rate
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_DisableAutoBaudRate(USART_T* usart)
{
    usart->CTRL2_B.ABRDEN = BIT_RESET;
}

/*!
 * @brief       Enables the auto baud rate
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3.
 *
 * @param       mode:   specifies the selected USART auto baud rate method
 *                      This parameter can be one of the following values:
 *                      @arg USART_AUTO_BAUD_RATE_STARTBIT:    Start Bit duration measurement
 *                      @arg USART_AUTO_BAUD_RATE_FALLINGEDGE: Falling edge to falling edge measurement
 *
 * @retval      None
 *
 * @note        The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 */
void USART_ConfigAutoBaudRate(USART_T* usart, USART_AUTO_BAUD_RATE_T mode)
{
    usart->CTRL2_B.ABRDCFG = mode;
}

/*!
 * @brief       Transmit Data
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3/USART4/USART5/USART6/USART7/USART8.
 *
 * @param       data:    Specifies the Transmits data value
 *
 * @retval      None
 *
 * @note        It's not for APM32F030 devices.
 *              The USART2 only for APM32F072 and APM32F091 devices.
 *              The USART3 only for APM32F091 devices.
 *
 * @note        The value must less than 0x01FF
 */
void USART_TxData(USART_T* usart, uint16_t data)
{
    usart->TXDATA = (data & (uint16_t)0x01FF);
}

/*!
 * @brief       Received Data
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3/USART4/USART5/USART6/USART7/USART8.
 *
 * @retval      Returns the received data value
 *
 * @note        The USART3/USART4 only for APM32F072 and APM32F091 devices.
 *              USART5, USART6, USART7 and USART8 are available only for APM32F091 devices.
 */
uint16_t USART_RxData(USART_T* usart)
{
    return (uint16_t)(usart->RXDATA & (uint16_t)0x01FF);
}

/*!
 * @brief       Sets USART the address
 *
 * @param       usart:  Select the the USART peripheral.
 *                      It can be USART1/USART2/USART3/USART4/USART5/USART6/USART7/USART8.
 *
 * @retval      None
 *
 * @note        The USART3/USART4 only for APM32F072 and APM32F091 devices.
 *              USART5, USART6, USART7 and USART8 are available only for APM32F091 devices.
 */
void USART_Address(USART_T* usart, uint8_t address)
{
    usart->CTRL2_B.ADDRL = ((uint8_t)address & 0x0F);
    usart->CTRL2_B.ADDRH = ((uint8_t)address >> 4 & 0x0F);

